application/basic/controllers/BooksController.php

    public function actionCreate($closeOnLoad=false)
    {
        $model = new Books();
		$data = $this->filterData(Yii::$app->request->post());

        if ($model->load($data) && $model->save()) {
---
INSERT INTO `books` (`author_id`, `name`, `date`, `preview`, `date_create`, `date_update`) VALUES (1, 'sadfsdf', '2015-10-05', '', '2016-01-13 19:13:10', '2016-01-13 19:13:10')

    protected function findModel($id)
    {
		$model = Books::find()->with('authors')->where(['id'=>$id])->one();
---
SELECT * FROM `authors` WHERE `id`=1
SELECT * FROM `books` WHERE `id`='55'

	protected function getAuthorsForDropDownList($before=[])
	{
		$authors = (new \app\models\Authors())->find()->asArray()->all();
---
SELECT * FROM `authors`